package patterns

import (
	"razdel/pkg/set"
	"strings"
)

func parseSokrs(lines []string) []string {
	var res []string
	for _, line := range lines {
		for _, word := range strings.Split(line, " ") {
			res = append(res, word)
		}
	}
	return res
}

var TAIL_SOKRS = set.New(parseSokrs([]string{
	"дес тыс млн млрд",
	"дол долл",
	"коп руб р",
	"проц", // 95 проц. акций,

	"га",
	"барр",  // 40 долларов за барр.
	"куб",   // 1000 куб. метр.
	"кв км", // 700 тыс. кв. км.
	"см",    // 30 см

	"час мин сек", // в 15 час. 13 мин. 53 сек.
	"в вв",        // XII в. XVIII—XIX вв.
	"г гг",        // 1996-1999гг

	"с стр", // 287 стр.

	"co corp inc",

	"изд ed", // 1-е изд. Arthur W. Hummel, ed. Eminent Chinese

	"др", // и другие
	"al", // North et al.
}))

var HEAD_SOKRS = set.New(parseSokrs([]string{
	"букв", // яп. 18禁, букв. «запрещено
	"ст",   // ст.-слав.
	"трад", // кит. трад
	"лат венг исп кат укр нем англ фр итал греч",
	"евр араб яп слав кит рус русск латв",
	"словацк хорв",

	"mr mrs ms dr vs",
	"св", // св.Иоанна
	"арх зав зам проф акад",
	"кн",      // кандидат наук
	"корр",    // сообщил корр. ИТАР-ТАСС
	"ред",     // Под ред. Линды Уильямс
	"гр",      // гр. Валевской
	"ср",      // Ср. L. Ross
	"чл корр", // является чл.-корр. АН СССР
	"им",      // им. Вс. Мейерхольда
	"тов",     // тюремном подвале тов. Берия

	"нач пол", // нач. XX века

	"chap",
	"п пп ст ч чч гл стр абз пт", // ст. 129 ч. 2 п. 8 Гл. VI
	"no", // No. 6

	"просп пр ул ш г гор д стр к корп пер корп обл эт пом ауд оф ком комн каб",
	"домовлад лит",
	"т",          // т. 1 л.д. 85-89
	"рп пос с х", // х. Ново-Максимовский, с. Кляшево рп.Раздолинск
	"пл",         // площадь
	"bd",         // Bd. 16, Berlin
	"о оз",       // Вблизи оз. Селяха
	"р",          // р. Иордан
	"а",          // а. Адыге-Хабль

	"обр",  // обр. 1936 г.
	"ум",   // ум. 1064
	"ок",   // "родилась ок. 1211", "работают ок. 150 специалистов"
	"откр", // Откр. 20:40

	"пс ps",
	"upd",
	"см",
	"напр", // UNIX-семейства, напр. Linux, FreeBSD
	"доп",

	"юр физ", // юр. адрес

	"тел",
	"сб",    // Сб. «Киноварь»
	"внутр", // к внутр. миру героев
	"дифф",  // мне по дифф. зачёту «5» поставил
	"гос",   // гос. экзамены
	"отм",   // от отм. 0.000
}))

var OTHER_SOKRS = set.New(parseSokrs([]string{
	"сокр рис искл прим",

	"яз",
	"устар", // пометкой "устар."
	"шутл",  // "в стиле шутл.", "bones — шутл. человек"
}))

var SOKRS = TAIL_SOKRS.Add(HEAD_SOKRS).Add(OTHER_SOKRS)
